Revit 2027 API
RebarFreeFormAccessor.SetLayoutAsFixedNumber Method
 Sets the Layout Rule property of rebar set to Fixed Number.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLayoutAsFixedNumber(
	int numberOfBars
)
Public Sub SetLayoutAsFixedNumber (
	numberOfBars As Integer
)
public:
void SetLayoutAsFixedNumber(
	int numberOfBars
)
member SetLayoutAsFixedNumber :
        numberOfBars : int -> unit
Parameters
numberOfBars Int32
 The number of bars in set.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  the number of bar positions numberOfBars is less than 1 or more than 1002.
InvalidOperationException |  This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace